using UnityEngine;

public class CoroutineCtrl : MonoSingTon<CoroutineCtrl>
{
    //      ┏┛ ┻━━┛ ┻━
    //      ┃　　　　　　   ┃
    //      ┃　　　━　　　 ┃
    //      ┃　┳┛　  ┗┳ ┃
    //      ┃　　　　　　   ┃
    //      ┃　　　┻　　　 ┃
    //      ┃　　　　　　   ┃
    //      ┗ ┓　　　┏━—┛
    //         ┃　　　┃   神兽保佑
    //         ┃　　　┃   代码无BUG！
    //         ┃　　　┗━━━━━━
    //         ┃　　　　　　　    ┣┓
    //         ┃　　　　         ┏┛
    //         ┗━┓ ┓ ┏━━━┳ 
    //           ┃ ┫ ┫   ┃ ┫ ┫
    //          ┗━┻━┛   ┗━┻

    ///*******************************
    ///这个脚本是异步加载UI的桥梁，不要删！
    ///*******************************
}
